areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hsadc.c
	ADCON1Lbits.ADON = ADC_OFF;			// Disable ADC module 

	return(1 - ADCON1Lbits.ADON);

}

/*!hsadc_reset()
 * ************************************************************************************************
 * Summary:
 * Resets ADC configuration
 *
 * Parameters:	(none)
 *
 * Description:
 * Resets the entire ADC configuration including the port control registers. All ANx-inputs will
 * become GPIOs.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_reset(void)
{
	// Reset all ADC configuration registers to defaults

	ADCON1Lbits.ADON = ADC_OFF;				// Disable ADC
  
	ADCON1L	= REG_ADCON1L_RESET;			// Disable and reset ADC configuration register 1 low
	ADCON1H	= REG_ADCON1H_RESET;			// Disable and reset ADC configuration register 1 high
	ADCON2L	= REG_ADCON2L_RESET;			// Disable and reset ADC configuration register 2 low
	ADCON2H	= REG_ADCON2H_RESET;			// Disable and reset ADC configuration register 2 high
    ADCON3L = REG_ADCON3L_RESET;			// Disable and reset ADC configuration register 3 low
    ADCON3H = REG_ADCON3H_RESET;			// Disable and reset ADC configuration register 3 high
    #if defined (ADCON4L)
    ADCON4L = REG_ADCON4L_RESET;			// Disable and reset ADC configuration register 4 low
    #endif
    #if defined (ADCON4H)
    ADCON4H = REG_ADCON4H_RESET;			// Disable and reset ADC configuration register 4 high
    #endif
    ADCON5L = REG_ADCON5L_RESET;			// Disable and reset ADC configuration register 5 low
    ADCON5H = REG_ADCON5H_RESET;			// Disable and reset ADC configuration register 5 high
    
	return(1);
}

/*!hsadc_power_on_adc_core()
 * ************************************************************************************************
 * Summary:
 * Turns on a single ADC core considering warm-up time
 *
 * Parameters:	(none)
 *
 * Description:
 * The individual ADC cores of the ADC peripheral require a self calibration procedure 
 * to meet the values given in the data sheet. The following function performs the self
 * calibration of the given ADC core.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_check_adc_cores_ready(void)
{
    volatile uint16_t timeout = 0, rdy_compare = 0, reg_buf = 0;
    
    reg_buf = (ADCON5L & 0x00FF);
    rdy_compare = (reg_buf << 8);

    while( (((ADCON5L << 8) & 0xFF00) != rdy_compare) && (timeout++ < 0xFFFE) );
    if(timeout == 0xFFFF) return(0);
    else return(1);

}

/*!hsadc_calibrate_adc_core()
 * ************************************************************************************************
 * Summary:
 * Calls the ADC calibration of a single ADC core
 *
 * Parameters:	(none)
 *
 * Description:
 * The individual ADC cores of the ADC peripheral require a self calibration procedure 
 * to meet the values given in the data sheet. The following function performs the self
 * calibration of the given ADC core.
 * ***********************************************************************************************/
#if defined (__P33SMPS_EP__)
inline volatile uint16_t hsadc_calibrate_adc_core(uint16_t index, uint16_t calib_mode)
{
	volatile uint16_t timeout=0;
    volatile uint16_t *regptr;
    volatile uint16_t reg_offset=0;
    
    if (index >= ADC_CORE_COUNT) return(0);
    
    reg_offset = ((index >> 1) * ADC_ADCAL_REG_OFFSET);   // Index is divided by 2 due to shared registers
    regptr = (volatile uint16_t *)&ADCAL0L + reg_offset;
    
    // differentiate between odd and even indices due to shared registers
    if (index == ADC_SHARED_CORE_INDEX) {

        regptr = (volatile uint16_t *)&ADCAL1H;

        if ((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0)
        {
            *regptr |= REG_ADCALx_HB_CALxEN_SET_MSK;  // Enable calibration
            *regptr &= REG_ADCALx_HB_CALxSKIP_CLR_MSK;  // Initiate calibration
            *regptr &= ((calib_mode << 8) | REG_ADCALx_HB_CALxDIFF_CLR_MSK);  // Set calibration mode (differential or single ended))
            *regptr |= REG_ADCALx_HB_CALxRUN_SET_MSK;  // Initiate calibration

            // Wait until ADC core calibration has completed
            while( ((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0) && (timeout++<5000));
            if((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0) return(0);  // If core doesn't enter READY state, return failure

            *regptr &= REG_ADCALx_HB_CALxEN_CLR_MSK;  // Disable calibration
        }
        
    }
    else if(index & 0x0001) {
        // Odd index (1, 3, 5, ...) and shared ADC bits are located in the high-byte of the register word
        
        if ((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0)
        {
            *regptr |= REG_ADCALx_HB_CALxEN_SET_MSK;  // Enable calibration
            *regptr &= REG_ADCALx_HB_CALxSKIP_CLR_MSK;  // Initiate calibration
            *regptr &= ((calib_mode << 8) | REG_ADCALx_HB_CALxDIFF_CLR_MSK);  // Set calibration mode (differential or single ended))
            *regptr |= REG_ADCALx_HB_CALxRUN_SET_MSK;  // Initiate calibration

            // Wait until ADC core calibration has completed
            while( ((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0) && (timeout++<5000));
            if((*regptr & REG_ADCALx_HB_CALxRDY_SET_MSK) == 0) return(0);  // If core doesn't enter READY state, return failure

            *regptr &= REG_ADCALx_HB_CALxEN_CLR_MSK;  // Disable calibration
        }
    }
    else{
        // Even index (0, 2, 4, ...) bits are located in the low-byte of the register word
        
        if ((*regptr & REG_ADCALx_LB_CALxRDY_SET_MSK) == 0)
        {
            *regptr |= REG_ADCALx_LB_CALxEN_SET_MSK;  // Enable calibration
            *regptr &= REG_ADCALx_LB_CALxSKIP_CLR_MSK;  // Initiate calibration
            *regptr &= (calib_mode | REG_ADCALx_LB_CALxDIFF_CLR_MSK);  // Set calibration mode (differential or single ended))
            *regptr |= REG_ADCALx_LB_CALxRUN_SET_MSK;  // Initiate calibration

            // Wait until ADC core calibration has completed
            while( ((*regptr & REG_ADCALx_LB_CALxRDY_SET_MSK) == 0) && (timeout++<5000));
            if((*regptr & REG_ADCALx_LB_CALxRDY_SET_MSK) == 0) return(0);  // If core doesn't enter READY state, return failure

            *regptr &= REG_ADCALx_LB_CALxEN_CLR_MSK;  // Disable calibration
        }
    }
	
	return(1);
	
