areiter128/SMPS-MCAL-PLIB/p33SMPS_mcal.X/plibs/dsPIC33C/p33SMPS_hsadc.c
    // Map bit on right register (HIGH or LOW)
    if (index<16) {   
        // Setting the Trigger Mode Bit
        regptr = (volatile uint16_t *)&ADLVLTRGL;
        regval = (((volatile uint16_t)trigger_mode << index) & REG_ADSTATL_VALID_DATA_MSK);
    }
    else {

        #ifdef ADLVLTRGH
        index -= 16;    // Scale ANx-number down into single register field
        regptr = (volatile uint16_t *)&ADLVLTRGH; // Set the Trigger Mode Bit
        regval = (((volatile uint16_t)trigger_mode << index) & REG_ADSTATH_VALID_DATA_MSK);
        #else
        return(0);  // Return ERROR if register does not exists
        #endif
    }

    // write value to register
    *regptr |= regval;
    
    // Check if bit has been set
    fres = (volatile bool)((*regptr & regval) == regval);

    // Return Success/Error bit
	return(fres);
	
}

/*!hsadc_init_adc_comp
 * ************************************************************************************************
 * Summary:
 * Initializes an individual digital ADC Comparator configuration
 *
 * Parameters:
 *	regADCMPxCON = holds the register value for the ADC comparator configuration register (ADCMPxCON)
 *	regADCMP0ENx = holds the register value for the ADC input used as data input
 *  regADCMPxLO = holds the compare value for the lower trip point threshold
 *  regADCMPxHI = holds the compare value for the upper trip point threshold
 * 
 * Description:
 * The ADC peripheral features a digital comparator, which compares the latest sample of a dedicated
 * ANx input with given upper and lower threshold values. If the values is outside the given range,
 * an interrupt will be triggered (if enabled).
 * This routine allows configuration of the comparator, the input source and its thresholds.
 * ***********************************************************************************************/

inline volatile uint16_t hsadc_init_adc_comp(uint16_t index, uint16_t input_no, uint16_t regADCMPxCON, uint16_t regADCMPxLO, uint16_t regADCMPxHI)
{

volatile uint16_t *regptr;
volatile uint16_t reg_offset=0;

	if (index >= REG_ADCMP_COUNT) return(0);

    // ADC Comparator Configuration
    reg_offset = ( index * REG_ADCMP_REG_OFFSET );
    regptr = (volatile uint16_t *)&ADCMP0CON + reg_offset;
    *regptr = (regADCMPxCON & REG_ADCMPxCON_VALID_DATA_WR_MSK);

    // Lower Threshold Compare Value
    reg_offset = ( index * REG_ADCMPxLO_OFFSET );
    regptr = (volatile uint16_t *)&ADCMP0LO + reg_offset;
    *regptr = (regADCMPxLO & REG_ADCMPxLO_VALID_DATA_MASK);

    // Upper Threshold Compare Value
    reg_offset = ( index * REG_ADCMPxHI_OFFSET );
    regptr = (volatile uint16_t *)&ADCMP0HI + reg_offset;
    *regptr = (regADCMPxHI & REG_ADCMPxHI_VALID_DATA_MASK);
    
    // Assigning ANx inputs for the comparison
    if (input_no < 16) {   

        // Enabling the corresponding analog input comparator input
        reg_offset = ( index * REG_ADCMPxEN_REG_OFFSET );
        regptr = (volatile uint16_t *)&ADCMP0ENL + reg_offset;
        *regptr = (1 << input_no);

    }
    else if (input_no < 32) {

        input_no -= 16;

        #ifdef ADCMP0ENH
        // Enabling the corresponding analog input comparator input
        reg_offset = ( index * REG_ADCMPxEN_REG_OFFSET );
        regptr = (volatile uint16_t *)&ADCMP0ENH + reg_offset;
        *regptr = (1 << input_no);
        #else
        return(0);
        #endif
    }
    else { return(0); }
    
    return(1);
    
}

//------------------------------------------------------------------------------
// PRIVATE FUNCTIONS
//------------------------------------------------------------------------------
// ToDo: may be obsolete (and is unfinished anyways) :-)
//inline volatile uint16_t write_channel_register(uint16_t index, uint16_t *reg_addr, bool value)
//{
//    volatile uint16_t *regptr;
//    
//    if (index >= ADC_ANINPUT_COUNT) { return(0); }
//    
//    if (index<16) {   
//
//        // Setting the Early Interrupt Enable Bit
//        regptr = (volatile uint16_t *)&ADEIEL;
//        *regptr |= (early_interrupt_enable << index);
//
//        // Setting the Interrupt Enable Bit
//        regptr = (volatile uint16_t *)&ADIEL;
//        *regptr |= ((volatile uint16_t)value << index);
//    }
//    else {
//
//        index -= 16;
//
//        #ifdef ADEIEH
//        // Setting the Early Interrupt Enable Bit
//        regptr = (volatile uint16_t *)&ADEIEH;
//        *regptr |= (early_interrupt_enable << index);
//
//        // Setting the Interrupt Enable Bit
//        regptr = (volatile uint16_t *)&ADIEH;
//        *regptr |= (interrupt_enable << index);
//        #else
//        return(0);
//        #endif
//    }
//    
//	return(1);
//	
//}



// EOF
